/**
 * @project Blamper
 * @user front-end / delosgatos(a)gmail.com
 * @date 04.10.13 18:33
 */

define({
    ru:{
        PROFILE:{
            PERSONAL_SAVED: 'Ваша личная информация успешно сохранена!'
           ,PERSONAL_INCORRECT: 'Неверно или неполностью заполнена информация!'
           ,WORK_SAVED: 'Информация о работе успешна сохранена!'
           ,CONTACTS_SAVED: 'Контактные днанные успешно сохранены!'
           ,CAR_GENERAL_SAVED: 'Описание автомобиля успешно сохранено!'
           ,CAR_TECH_SAVED: 'Технические характеристики автомобиля успешно сохранены!'
           ,CAR_INFO_SAVED: 'Общая информация об автомобиле успешно сохранена!'
           ,CAR_INFO_INCORRECT: 'Заполните недостающие поля!'
           ,NO_COVER: 'Фото автомобиля не выбрано!'
           ,COVER_CHANGED: 'Фото автомобиля успешно сохранено!'
           ,NO_AVATAR: 'Выберите аватар для сохранения!'
           ,AVATAR_CHANGED: 'Фото успешно сохранено!'
           ,ALL_SAVED: 'Поздравляем! Вы рассказали о себе на 100%'
        },
        EMAIL_FRIENDS:{
            WRONG_EMAIL: 'Вы ввели неправильный e-mail'
           ,WRONG_CREDENTIALS: 'Неверный адрес почты или пароль'
           ,WRONG_SERVICE: 'Невозможно использовать такой адрес почты'
           ,UNKNOWN_ERROR: 'Невозможно обработать ваш запрос. Возможно, вы ошиблись'
           ,NO_RESULTS: 'Нет контактов в вашем почтовом ящике'
        },
        POST_FORM_PHRASES: [
            "Расскажите о вашем первом автомобиле",
            "Расскажите, что вам нравится в вашем автомобиле",
            "Расскажите, что вам не нравится в вашем автомобиле",
            "Вы уже переобули резину?",
            "Расскажите какую зимнюю резину поставили?",
            "Как доехали сегодня до работы?",
            "Сколько часов в день вы проводите за рулем?",
            "Расскажите о вашей самой дальней поездке",
            "Расскажите о вашем последнем автопутешествии",
            "Расскажите как вы получали права",
            "Расскажите о вашем последнем ДТП",
            "Расскажите о вашем последнем ТО",
            "Расскажите о вашем последнем тюнинге",
            "Расскажите как вы выбирали автомобиль",
            "Расскажите как вы покупали автомобиль",
            "Расскажите, как вы продавали автомобиль"
        ],
        MESSAGES:{
            ERRROR_CONVERSATION_CREATION: 'Неивестная ошибка создания диалога'
        },
        SIGNUP:{
            ERRROR_SERVER_CONNECTION: 'Ошибка соединения с сервером! Попробуйте войти позже.'
        },
        SERVER:{
            DATA_ERROR: 'Сервер не смог обработать отправленные данные'
        }
    }
});